todo.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>

<title>TODO for civ0</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-08-22 00:58:48 EDT"/>
<meta name="author" content="Alex Henning"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">
<h1 class="title">TODO for civ0</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 For 0.1 Functioning alpha </a>
<ul>
<li><a href="#sec-1.1">1.1 AI </a>
<ul>
<li><a href="#sec-1.1.1">1.1.1 Add lazy city defenders. </a></li>
<li><a href="#sec-1.1.2">1.1.2 Add lazy city attackers </a></li>
</ul>
</li>
<li><a href="#sec-1.2">1.2 UI </a>
<ul>
<li><a href="#sec-1.2.1">1.2.1 When selecting a tech, the status bar should show a short description of it. </a></li>
<li><a href="#sec-1.2.2">1.2.2 When hovering over land while a settler is the active unit, the status bar should show relevent details. </a></li>
<li><a href="#sec-1.2.3">1.2.3 Fix build queques </a></li>
</ul>
</li>
<li><a href="#sec-1.3">1.3 Fix fog of war </a></li>
<li><a href="#sec-1.4">1.4 On death of final unit, game gets screwy&hellip; Fix! </a></li>
<li><a href="#sec-1.5">1.5 Allow cities to be captured </a></li>
<li><a href="#sec-1.6">1.6 Barracks doesn't actually work&hellip; </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Eventually&hellip; (like really low priority&hellip;) </a>
<ul>
<li><a href="#sec-2.1">2.1 Support android phones </a></li>
<li><a href="#sec-2.2">2.2 Support blackberry devices </a></li>
<li><a href="#sec-2.3">2.3 Support iphones </a></li>
<li><a href="#sec-2.4">2.4 Support ipad </a></li>
<li><a href="#sec-2.5">2.5 Fancy terrain rendering </a></li>
<li><a href="#sec-2.6">2.6 Add multiple AI "nationalities" </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> For 0.1 Functioning alpha </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> AI </h3>
<div class="outline-text-3" id="text-1.1">


</div>

<div id="outline-container-1.1.1" class="outline-4">
<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> <span class="todo TODO"> TODO</span> Add lazy city defenders. </h4>
<div class="outline-text-4" id="text-1.1.1">

</div>

</div>

<div id="outline-container-1.1.2" class="outline-4">
<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> <span class="todo TODO"> TODO</span> Add lazy city attackers </h4>
<div class="outline-text-4" id="text-1.1.2">

</div>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> UI </h3>
<div class="outline-text-3" id="text-1.2">


</div>

<div id="outline-container-1.2.1" class="outline-4">
<h4 id="sec-1.2.1"><span class="section-number-4">1.2.1</span> <span class="todo TODO"> TODO</span> When selecting a tech, the status bar should show a short description of it. </h4>
<div class="outline-text-4" id="text-1.2.1">

<p>It works in firefox, but not chromium?
</p></div>

</div>

<div id="outline-container-1.2.2" class="outline-4">
<h4 id="sec-1.2.2"><span class="section-number-4">1.2.2</span> <span class="todo TODO"> TODO</span> When hovering over land while a settler is the active unit, the status bar should show relevent details. </h4>
<div class="outline-text-4" id="text-1.2.2">

<p>ie. "A city can't be built here" or "A city built here has the potential for 14 points (12f/0p/2t)"
</p></div>

</div>

<div id="outline-container-1.2.3" class="outline-4">
<h4 id="sec-1.2.3"><span class="section-number-4">1.2.3</span> Fix build queques </h4>
<div class="outline-text-4" id="text-1.2.3">

<ul>
<li id="sec-1.2.3.1"><span class="todo TODO"> TODO</span> Coloring of the queques <br/>
</li>
<li id="sec-1.2.3.2"><span class="done DONE"> DONE</span> Being able to actually see the queque <br/>
</li>
<li id="sec-1.2.3.3"><span class="todo TODO"> TODO</span> Limit buildings/units that should only be built in port cities <br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> <span class="todo TODO"> TODO</span> Fix fog of war </h3>
<div class="outline-text-3" id="text-1.3">

<p>Sometimes it takes a turn or two before tiles are revealed.
</p></div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> <span class="todo TODO"> TODO</span> On death of final unit, game gets screwy&hellip; Fix! </h3>
<div class="outline-text-3" id="text-1.4">

<p>It crashes with the error:
</p><pre class="example">
Uncaught TypeError: Cannot read property 'active' of undefined index.htm:1914 
</pre>

<p>"Resume" gives you control of an enemy unit, but you can't see it.
The desired behavior is that the game asks you if you want to change any of your cities production and then runs the AI till you produce a unit or it overruns you.
</p>
<p>
Also was triggered by the following error even though not all units were dead.
</p><pre class="example">
Uncaught TypeError: Cannot read property 'player' of undefined (index.htm:980)
CombatNeighboringUnit (index.htm:980)
MoveUnitToDestination (index.htm:1028)
EndOfTurn (index.htm:1896)
Turn (index.htm:1886)
i (index.htm:1974)
KeyPressHandler (index.htm:1765)
(anonymous function) (index.htm:20)
onkeypress (index.htm:20)
</pre>

</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5"><span class="section-number-3">1.5</span> <span class="todo TODO"> TODO</span> Allow cities to be captured </h3>
<div class="outline-text-3" id="text-1.5">

</div>

</div>

<div id="outline-container-1.6" class="outline-3">
<h3 id="sec-1.6"><span class="section-number-3">1.6</span> <span class="todo TODO"> TODO</span> Barracks doesn't actually work&hellip; </h3>
<div class="outline-text-3" id="text-1.6">

<p>Barracks should increase veterancy of built units; in reality it doesn't/
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Eventually&hellip; (like really low priority&hellip;) </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> <span class="todo TODO"> TODO</span> Support android phones </h3>
<div class="outline-text-3" id="text-2.1">

</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> <span class="todo TODO"> TODO</span> Support blackberry devices </h3>
<div class="outline-text-3" id="text-2.2">

</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> <span class="todo TODO"> TODO</span> Support iphones </h3>
<div class="outline-text-3" id="text-2.3">

</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> <span class="todo TODO"> TODO</span> Support ipad </h3>
<div class="outline-text-3" id="text-2.4">

</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5"><span class="section-number-3">2.5</span> <span class="todo TODO"> TODO</span> Fancy terrain rendering </h3>
<div class="outline-text-3" id="text-2.5">

<p>Render each tile so that it's less blocky by taking into account surrounding territory.
</p></div>

</div>

<div id="outline-container-2.6" class="outline-3">
<h3 id="sec-2.6"><span class="section-number-3">2.6</span> <span class="todo TODO"> TODO</span> Add multiple AI "nationalities" </h3>
<div class="outline-text-3" id="text-2.6">

<p>Just add a few AI cities with different colors and units with matching colors.
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Alex Henning
<a href="mailto:elcron@gmail.com">&lt;elcron@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2010-08-22 00:58:48 EDT</p>
<p class="creator">HTML generated by org-mode 6.30c in emacs 23</p>
</div>
</div>
</body>
</html>
